{"ABM" : "Automated banking machine.",
"Account level charge" : "Charges against any account transactions (i.e., withdrawal, deposit, transfer). Charges vary between accounts.",
"Amortization Period" : "The actual number of years it will take to repay a mortgage loan in full. This may go beyond the term of the loan. For example, mortgages often have five-year terms and 25-year amortization periods.",
"Annual fee" : "The administration fee charged each year on a credit card account.",
"Appraised Value" : "An estimate of the value of the property offered as security for a mortgage loan. The appraisal is done for mortgage lending purposes and the appraisal value may be less than the purchase price of the property.",
"Assets" : "Your possessions, including property, cash and investments.",
"Bankrupt" : "Technically this means being insolvent, or declared by law as unable to pay debts. The result of declaring bankruptcy is that you may be prevented from obtaining credit for a car, credit card, home or a student loan for at least 7 years by financial institutions.",
"Canada Mortgage and Housing Corporation (CMHC)" : "The Corporation of the Federal Government that provides mortgage insurance to lenders against borrower default, under the National Housing Act (NHA).",
"Chequing Account" : "this is a type of account where you can access your money on demand. You must make sure you always have enough money in your chequing account to cover the cheques that you have written.",
"Class A loan" : "While the student is in full-time studies: Federal Student Loans: the government pays the interest For ScotiaLine for Students: the student pays only the interest",
"Class B loan" : "A student loan that is due for full repayment (e.g., principal & interest payments) following graduation, or no longer in full-time studies.",
"Class B date" : "The time at which a student loan must begin full repayment: 6 months following the end of full-time studies.",
"Closed and Open Mortgages" : "A closed mortgage agreement does not provide for payout before the maturity date. A lender may permit early payout of a closed mortgage under certain circumstances but will charge a penalty for doing so. An open mortgage permits for prepayment/payout in full at any time without penalty.",
"Closing Date" : "The date on which the sale of the property becomes final and the new owner takes possession.",
"Collateral (Assets)" : "Usually property or investments used to secure a loan.",
"Collateral Mortgage" : "Provides security over real estate when loans are provided for purposes other than, or in addition to, the purchase of the land. This type of mortgage often secures a revolving loan. Also sometimes referred to as a \"Home Equity Loan\" or an \"Equity Take Out Mortgage\".",
"Condominium" : "A form of ownership in which the owner has title to a dwelling unit and owns a share of the common elements (such as elevators, hallways and the land).",
"Consolidation" : "Combining more than one debt into a single loan.",
"Conventional Mortgage" : "A mortgage loan that does not exceed 80% of the lesser of the appraised value or the purchase price of the property. A mortgage that exceeds that limit must be insured.",
"Co-signer" : "Person who signs a loan with you and shares responsibility for repayment of the loan.",
"Credit Bureau" : "A clearinghouse for credit information. Credit grantors provide the credit bureau with information on how their credit customers pay their bills and the bureau compiles information as a resource for credit grantors. Customers may review their own credit file at any credit bureau location.",
"Credit Card" : "such as a VISA* card allows the holder to charge purchases rather than pay cash. Generally, no interest is charged on new purchases as long as the monthly balance is paid in full in both the previous and current month by the due date (here is generally no interest-free rate period for cash advances, balance transfers, and VISA* cheques).",
"Credit File (Credit Bureau Report)" : "A record of information about payment history with credit grantors such as stores, banks and credit card companies, and includes information from \"public record\" (bankruptcies, judgments), which reflect a customer's ability to repay debts. The \"credit file\" is used by credit grantors for decisions regarding the extension of credit.",
"Daily interest" : "The interest calculated on a minimum or average daily account balances; usually credited to the account once a month.",
"Debit Card" : "another name for a Bank Card that allows you to access your accounts. You can use it at banking machines or to pay for purchases at retailers using the Interac*** Payment service.",
"Deficit" : "The result of expenditures being greater than income (the opposite of surplus).",
"Direct debit" : "A means of paying for goods and services with a magnetic debit card that authorizes transfer of the funds, via the Interac*** Direct Payment network, directly from your account to the merchant's account.",
"Debt Service Ratios (GDSR & TDSR)" : "The Gross Debt Service Ratio (GDSR) is the percentage of gross annual income required to cover payments associated with the principal residence (mortgage principal and interest, taxes, secondary financing, heating, and 50% of condominium fees, if any). The GDSR should not exceed 32% of gross annual income. The Total Debt Service Ratio (TDSR) is the percentage of gross annual income required to cover payments associated with housing and all other debts and obligations, such as payments on a car loan. The TDSR should not exceed 40% of gross income.",
"Down Payment" : "The amount of money (usually in the form of cash) put forward by the purchaser. It represents the difference between the purchase price and the amount of the mortgage loan.",
"Equity" : "Equity is the difference between the price for which a property could be sold and the total debts registered against it.",
"Fixed interest rate" : "An interest rate established at the time a loan is opened and which remains unchanged for the term of the loan.",
"Fixed Rate Mortgages" : "A fixed rate mortgage is where the rate of interest and payment amount are fixed for a specific term.",
"Floating interest rate" : "An interest rate that can change during the term of a loan; usually in accordance with the lending institution's prime rate.",
"Genworth" : "Genworth Financial Canada, a private mortgage default insurance provider.",
"GIC" : "(Guaranteed Investment Certificate) A savings instrument that pays a fixed rate of interest over a specified term.",
"Guarantor" : "A person who guarantees to repay a loan in the event that the borrower defaults.",
"High Ratio Mortgage" : "A mortgage loan that exceeds 80% of the lesser of the appraised value or purchase price of the property. This mortgage must be insured and borrowers must pay an application fee and the insurance premium (which may be added to the mortgage) to the insurer.",
"Interac Network" : "A network that links the ABMs of banks and other financial institutions in Canada, giving automated access to bank accounts using other participating banks' ABMs.",
"Interest Adjustment Date (I.A.D.)" : "The date the term of the mortgage starts and is usually the first of the month. An interest-only payment on mortgage funds advanced prior to the IAD will be due on this date. The first regular monthly principal and interest payment is due one month after the IAD.",
"Leasehold Mortgage" : "A mortgage loan on a home where the building is on leased (rented) land. The lender takes an interest in the lease.",
"Lien" : "A claim on a person's property as security for an unpaid debt.",
"Line of credit" : "A form of loan in which the borrower draws funds as needed, up to a specified maximum.",
"Loan-to-Value Ratio" : "The ratio of the mortgage loan to the appraised value or purchase price of the property, whichever is less, expressed as a percentage.",
"Maturity Date" : "The last day of the term of the mortgage agreement. The mortgage agreement must then be renewed or the mortgage balance paid in full.",
"Mortgagee" : "The lender",
"Mortgage Insurance" : "Distinct from mortgage life insurance or home, property, fire and casualty insurance; mortgage insurance provides protection to the lender in the event of a default by the borrower.",
"Mortgagor" : "The borrower",
"Mutual fund" : "A pooled investment fund in which individuals can purchase units.",
"National Housing Act (NHA) Loan" : "A mortgage loan insured by Canadian Mortgage and Housing Corporation (CMHC).",
"NSF" : "Not sufficient funds in account to cover the value of a cheque issued. The service charge for an NSF cheque is high and, worse, writing NSF cheques can damage a credit record.",
"Offer to Purchase" : "A formal, legal agreement between buyer and seller that offers a certain price for a specified real property. The offer may be firm (no conditions attached) or conditional (certain conditions must be fulfilled).",
"Payment due date" : "The date a loan or VISA payment is due.",
"Pre-Authorized Contribution (PAC)" : "an investment service (allocation of funds and frequency is the customer's choice) in which customers set up regular deposits to be automatically contributed to their investment.",
"Prepayment Charge/Penalty" : "A fee charged by the lender when the borrower pays off all or a portion of a mortgage more quickly than provided for in the mortgage agreement.",
"Prime rate" : "The interest rate banks charge their best corporate customers.",
"Principal" : "The amount of a loan excluding the interest.",
"P.I.T." : "Principal, interest, and taxes.",
"Refinance" : "The process of arranging a new mortgage for an increased amount or switching from a conventional to a collateral mortgage. The old mortgage(s) is (are) paid off/discharged from the proceeds of the new loan. This type of loan is also referred to as \"equity take out.",
"Registered Education Savings Program (RESP)" : "designed to help you save for the post-secondary education of a child. Although RESP contributions are not tax-deductible, they do allow savings to compound and grow on a tax-deferred basis until the funds are withdrawn for a qualified education program.",
"Renew" : "To extend a mortgage agreement with the same lender for another term. The length of the term and the conditions (such as the rate of interest) may be changed.",
"RRSP (Registered Retirement Savings Plan)" : "a government supported program in which contributions are made to defer the payment of income taxes and to build savings for retirement.",
"Savings Account" : "This type of bank account usually pays interest on the funds deposited and provides easy access to your money, although a cheque book is not provided.",
"Secondary Homes" : "A secondary home is a property other than the owner's principal residence. It may be purchased to meet special family circumstances or work demands, or as a cottage or leisure residence, and is intended for occupancy by the owner or a relative (on a rent free basis) at some time during the year. It does not include rental properties, part-time rentals, timeshares or rental pools.",
"Surplus" : "What's left over when income is higher than expenditures (the opposite of deficit).",
"Term" : "The period of time over which the interest rate, payment and other mortgage conditions are set. At the end of the term the mortgage is due and payable unless renewed.",
"Type A or Type B Vacation Properties" : "Generally speaking, Type A vacation properties are the same as standard residential properties in terms of quality of construction and materials used. They have year-round road access, and generally meet standard residential property lending requirements. Type B vacation properties must meet all Type A property requirements except for the following: 1. A standard heating system is not required. 2. Year-round road access is not required (e.g. unplowed road in the winter is acceptable)",
"TDSR" : "(Total Debt Service Ratio) The total of all monthly instalment payments (loans, rent, taxes, utility payments, etc.) divided by gross income."}
